n3rd-bugs/weird-rtos/port/target/stm32f407discovery/io/usb/usb_registers_stm32f407.h
/*
 * usb_registers_stm32f407.h
 *
 * Copyright (c) 2015 Usama Masood <mirzaon@gmail.com>
 *
 * Standard MIT License apply on this source code, with the inclusion of below
 * clause.
 *
 * This source is for educational purpose only, and should never be used for
 * any other purpose. If this source is used for other than educational purpose
 * (in any form) the author will not be liable for any legal charges.
 */
#ifndef _USB_REGISTERS_STM32F407_H_
#define _USB_REGISTERS_STM32F407_H_

#include <os.h>

#ifdef CONFIG_USB
#include <fs.h>

/* USB definitions.  */
#define USB_STM32F407_HS_BASE_ADDR          0x40040000
#define USB_STM32F407_FS_BASE_ADDR          0x50000000

#define USB_STM32F407_CORE_GLOBAL_OFFSET    0x000
#define USB_STM32F407_DEV_GLOBAL_OFFSET     0x800
#define USB_STM32F407_DEV_IN_EP_OFFSET      0x900
#define USB_STM32F407_EP_OFFSET             0x20
#define USB_STM32F407_DEV_OUT_EP_OFFSET     0xB00
#define USB_STM32F407_HOST_GLOBAL_OFFSET    0x400
#define USB_STM32F407_HOST_PORT_OFFSET      0x440
#define USB_STM32F407_HOST_CHAN_OFFSET      0x500
#define USB_STM32F407_CHAN_OFFSET           0x20
#define USB_STM32F407_PCGCCTL_OFFSET        0xE00
#define USB_STM32F407_DATA_FIFO_OFFSET      0x1000
#define USB_STM32F407_DATA_FIFO_SIZE        0x1000

#define USB_STM32F407_HS_MAX_PACKET_SIZE    512
#define USB_STM32F407_FS_MAX_PACKET_SIZE    64
#define USB_STM32F407_MAX_EP0_SIZE          64

/* USB General Registers. */
typedef struct _usb_stm32f407_gregs
{
    volatile uint32_t GOTGCTL;      /* USB OTG Control and Status Register  000h */
    volatile uint32_t GOTGINT;      /* USB OTG Interrupt Register           004h */
    volatile uint32_t GAHBCFG;      /* Core AHB Configuration Register      008h */
    volatile uint32_t GUSBCFG;      /* Core USB Configuration Register      00Ch */
    volatile uint32_t GRSTCTL;      /* Core Reset Register                  010h */
    volatile uint32_t GINTSTS;      /* Core Interrupt Register              014h */
    volatile uint32_t GINTMSK;      /* Core Interrupt Mask Register         018h */
    volatile uint32_t GRXSTSR;      /* Receive status Q Read Register       01Ch */
    volatile uint32_t GRXSTSP;      /* Receive status Q Read & POP Register             020h */
    volatile uint32_t GRXFSIZ;      /* Receive FIFO Size Register                       024h */
    volatile uint32_t DIEPTXF0_HNPTXFSIZ;   /* EP0 / Non Periodic TX FIFO Size Register 028h */
    volatile uint32_t HNPTXSTS;     /* Non Periodic TX FIFO/Queue status Register       02Ch */
    volatile uint32_t GI2CCTL;      /* I2C Access Register                  030h */
    uint32_t res34;                 /* PHY Vendor Control Register          034h */
    volatile uint32_t GCCFG;        /* General Purpose IO Register          038h */
    volatile uint32_t CID;          /* User ID Register                     03Ch */
    uint32_t res40[48];             /* Reserved                        040h-0FFh */
    volatile uint32_t HPTXFSIZ;     /* Host Periodic TX FIFO Size Register  100h */
    volatile uint32_t DIEPTXF[USB_MAX_FIFO];  /* Device Periodic Transmit FIFO. */
} USB_STM32F407_GREGS;

/* USB Device Registers. */
typedef struct _usb_stm32f407_dregs
{
    volatile uint32_t DCFG;         /* Device Configuration Register        800h */
    volatile uint32_t DCTL;         /* Device Control Register              804h */
    volatile uint32_t DSTS;         /* Device Status Register (RO)          808h */
    uint32_t res0C;                 /* Reserved                             80Ch */
    volatile uint32_t DIEPMSK;      /* Device IN Endpoint Mask              810h */
    volatile uint32_t DOEPMSK;      /* Device OUT Endpoint Mask             814h */
    volatile uint32_t DAINT;        /* Device All Endpoints Interrupt Register  818h */
    volatile uint32_t DAINTMSK;     /* Device All Endpoints Interrupt Mask      81Ch */
    uint32_t res20;                 /* Reserved                             820h */
    uint32_t res24;                 /* Reserved                             824h */
    volatile uint32_t DVBUSDIS;     /* Device VBUS discharge Register       828h */
    volatile uint32_t DVBUSPULSE;   /* Device VBUS Pulse Register           82Ch */
    volatile uint32_t DTHRCTL;      /* Device Threshold Register            830h */
    volatile uint32_t DIEPEMPMSK;   /* Device empty Mask                    834h */
    volatile uint32_t DEACHINT;     /* Dedicated EP interrupt               838h */
    volatile uint32_t DEACHMSK;     /* Dedicated EP Mask                    83Ch */
    uint32_t res40;                 /* Dedicated EP Mask                    840h */
    volatile uint32_t DINEP1MSK;    /* Dedicated EP Mask                    844h */
    uint32_t res44[15];             /* Reserved                         844-87Ch */
    volatile uint32_t DOUTEP1MSK;   /* Dedicated EP Mask                    884h */
} USB_STM32F407_DREGS;

/* USB IN Endpoint Registers. */
typedef struct _usb_stm32f407_inepregs
{
    volatile uint32_t DIEPCTL;      /* Device IN Endpoint Control Register      900h + (ep_num * 20h) + 00h */
    uint32_t res04;                 /* Reserved                                 900h + (ep_num * 20h) + 04h */
    volatile uint32_t DIEPINT;      /* Device IN Endpoint Interrupt Register    900h + (ep_num * 20h) + 08h */
    uint32_t res0C;                 /* Reserved                                 900h + (ep_num * 20h) + 0Ch */
    volatile uint32_t DIEPTSIZ;     /* IN Endpoint Transfer Size                900h + (ep_num * 20h) + 10h */
    volatile uint32_t DIEPDMA;      /* IN Endpoint DMA Address Register         900h + (ep_num * 20h) + 14h */
    volatile uint32_t DTXFSTS;      /* IN Endpoint TX FIFO Status Register      900h + (ep_num * 20h) + 18h */
    uint32_t res18;                 /* Reserved   900h + (ep_num * 20h) + 1Ch - 900h + (ep_num * 20h) + 1Ch */
} USB_STM32F407_INEPREGS;

/* USB OUT Endpoint Registers. */
typedef struct _usb_stm32f407_outepregs
{
    volatile uint32_t DOEPCTL;      /* Device OUT Endpoint Control Register     B00h + (ep_num * 20h) + 00h */
    volatile uint32_t DOUTEPFRM;    /* Device OUT Endpoint Frame number         B00h + (ep_num * 20h) + 04h */
    volatile uint32_t DOEPINT;      /* Device OUT Endpoint Interrupt Register   B00h + (ep_num * 20h) + 08h */
    uint32_t res0C;                 /* Reserved                                 B00h + (ep_num * 20h) + 0Ch */
    volatile uint32_t DOEPTSIZ;     /* Device OUT Endpoint Transfer Size        B00h + (ep_num * 20h) + 10h */
    volatile uint32_t DOEPDMA;      /* Device OUT Endpoint DMA Address          B00h + (ep_num * 20h) + 14h */
    uint32_t res18[2];              /* Reserved   B00h + (ep_num * 20h) + 18h - B00h + (ep_num * 20h) + 1Ch */
} USB_STM32F407_OUTEPREGS;

