n3rd-bugs/weird-rtos/port/target/stm32f407discovery/io/usb/usb_registers_stm32f407.h
/* USB Host Registers. */
typedef struct _usb_stm32f407_hregs
{
    volatile uint32_t HCFG;         /* Host Configuration Register          400h */
    volatile uint32_t HFIR;         /* Host Frame Interval Register         404h */
    volatile uint32_t HFNUM;        /* Host Frame Number/Frame Remaining    408h */
    uint32_t res0C;                 /* Reserved                             40Ch */
    volatile uint32_t HPTXSTS;      /* Host Periodic TX FIFO/ Queue Status  410h */
    volatile uint32_t HAINT;        /* Host All Channels Interrupt Register 414h */
    volatile uint32_t HAINTMSK;     /* Host All Channels Interrupt Mask     418h */
} USB_STM32F407_HREGS;

/* USB Host Channel Registers. */
typedef struct _usb_stm32f407_hc_regs
{
    volatile uint32_t HCCHAR;
    volatile uint32_t HCSPLT;
    volatile uint32_t HCINT;
    volatile uint32_t HCGINTMSK;
    volatile uint32_t HCTSIZ;
    volatile uint32_t HCDMA;
    uint32_t res[2];
} USB_STM32F407_HC_REGS;

/* USB Core Registers. */
typedef struct _usb_stm32f407_core_regs
{
    USB_STM32F407_GREGS *GREGS;
    USB_STM32F407_DREGS *DREGS;
    USB_STM32F407_HREGS *HREGS;
    USB_STM32F407_INEPREGS *INEP_REGS[USB_MAX_FIFO];
    USB_STM32F407_OUTEPREGS *OUTEP_REGS[USB_MAX_FIFO];
    USB_STM32F407_HC_REGS *HC_REGS[USB_MAX_FIFO];
    volatile uint32_t *HPRT0;
    volatile uint32_t *DFIFO[USB_MAX_FIFO];
    volatile uint32_t *PCGCCTL;
} USB_STM32F407_CORE_REGS;

/* USB register bits definitions. */

typedef union _usb_stm32f407_otgctl
{
    uint32_t d32;
    struct
    {
        uint32_t sesreqscs      : 1;
        uint32_t sesreq         : 1;
        uint32_t res2           : 6;
        uint32_t hstnegscs      : 1;
        uint32_t hnpreq         : 1;
        uint32_t hstsethnpen    : 1;
        uint32_t devhnpen       : 1;
        uint32_t res12_15       : 4;
        uint32_t conidsts       : 1;
        uint32_t res17          : 1;
        uint32_t asesvld        : 1;
        uint32_t bsesvld        : 1;
        uint32_t currmod        : 1;
        uint32_t res21_31       : 11;
    } b;
} USB_STM32F407_OTGCTL;

typedef union _usb_stm32f407_gotgint
{
    uint32_t d32;
    struct
    {
        uint32_t res0_1         : 2;
        uint32_t sesenddet      : 1;
        uint32_t res3_7         : 5;
        uint32_t sesreqsucstschng   : 1;
        uint32_t hstnegsucstschng   : 1;
        uint32_t res10_16       : 7;
        uint32_t hstnegdet      : 1;
        uint32_t adevtoutchng   : 1;
        uint32_t debdone        : 1;
        uint32_t res20_31       : 12;
    } b;
} USB_STM32F407_GOTGINT;

typedef union _usb_stm32f407_gahbcfg
{
    uint32_t d32;
    struct
    {
        uint32_t glblintrmsk    : 1;
        uint32_t hburstlen      : 4;
        uint32_t dmaenable      : 1;
        uint32_t res       : 1;
        uint32_t nptxfemplvl_txfemplvl  : 1;
        uint32_t ptxfemplvl     : 1;
        uint32_t res9_31        : 23;
    } b;
} USB_STM32F407_GAHBCFG;

typedef union _usb_stm32f407_gusbcfg
{
    uint32_t d32;
    struct
    {
        uint32_t toutcal        : 3;
        uint32_t phyif          : 1;
        uint32_t ulpi_utmi_sel  : 1;
        uint32_t fsintf         : 1;
        uint32_t physel         : 1;
        uint32_t ddrsel         : 1;
        uint32_t srpcap         : 1;
        uint32_t hnpcap         : 1;
        uint32_t usbtrdtim      : 4;
        uint32_t nptxfrwnden    : 1;
        uint32_t phylpwrclksel  : 1;
        uint32_t otgutmifssel   : 1;
        uint32_t ulpi_fsls      : 1;
        uint32_t ulpi_auto_res  : 1;
        uint32_t ulpi_clk_sus_m : 1;
        uint32_t ulpi_ext_vbus_drv          : 1;
        uint32_t ulpi_int_vbus_indicator    : 1;
        uint32_t term_sel_dl_pulse          : 1;
        uint32_t res            : 6;
        uint32_t force_host     : 1;
        uint32_t force_dev      : 1;
        uint32_t corrupt_tx     : 1;
    } b;
} USB_STM32F407_GUSBCFG;

typedef union _usb_stm32f407_grstctl
{
    uint32_t d32;
    struct
    {
        uint32_t csftrst        : 1;
        uint32_t hsftrst        : 1;
        uint32_t hstfrm         : 1;
        uint32_t intknqflsh     : 1;
        uint32_t rxfflsh        : 1;
        uint32_t txfflsh        : 1;
        uint32_t txfnum         : 5;
        uint32_t res11_29       : 19;
        uint32_t dmareq         : 1;
        uint32_t ahbidle        : 1;
    } b;
} USB_STM32F407_GRSTCTL;

typedef union _usb_stm32f407_gintmsk
{
    uint32_t d32;
    struct
    {
        uint32_t res0           : 1;
        uint32_t modemismatch   : 1;
        uint32_t otgintr        : 1;
        uint32_t sofintr        : 1;
        uint32_t rxstsqlvl      : 1;
        uint32_t nptxfempty     : 1;
        uint32_t ginnakeff      : 1;
        uint32_t goutnakeff     : 1;
        uint32_t res8           : 1;
        uint32_t i2cintr        : 1;
        uint32_t erlysuspend    : 1;
        uint32_t usbsuspend     : 1;
        uint32_t usbreset       : 1;
        uint32_t enumdone       : 1;
        uint32_t isooutdrop     : 1;
        uint32_t eopframe       : 1;
        uint32_t res16          : 1;
        uint32_t epmismatch     : 1;
        uint32_t inepintr       : 1;
        uint32_t outepintr      : 1;
        uint32_t incomplisoin   : 1;
        uint32_t incomplisoout  : 1;
        uint32_t res22_23       : 2;
        uint32_t portintr       : 1;
        uint32_t hcintr         : 1;
        uint32_t ptxfempty      : 1;
        uint32_t res27          : 1;
        uint32_t conidstschng   : 1;
        uint32_t disconnect     : 1;
        uint32_t sessreqintr    : 1;
        uint32_t wkupintr       : 1;
    } b;
} USB_STM32F407_GINTMSK;

typedef union _usb_stm32f407_gintsts
{
    uint32_t d32;
    struct
    {
        uint32_t curmode        : 1;
        uint32_t modemismatch   : 1;
        uint32_t otgintr        : 1;
        uint32_t sofintr        : 1;
        uint32_t rxstsqlvl      : 1;
        uint32_t nptxfempty     : 1;
        uint32_t ginnakeff      : 1;
        uint32_t goutnakeff     : 1;
        uint32_t res8           : 1;
        uint32_t i2cintr        : 1;
        uint32_t erlysuspend    : 1;
        uint32_t usbsuspend     : 1;
        uint32_t usbreset       : 1;
        uint32_t enumdone       : 1;
        uint32_t isooutdrop     : 1;
        uint32_t eopframe       : 1;
        uint32_t intimerrx      : 1;
        uint32_t epmismatch     : 1;
        uint32_t inepint        : 1;
        uint32_t outepintr      : 1;
        uint32_t incomplisoin   : 1;
        uint32_t incomplisoout  : 1;
        uint32_t res22_23       : 2;
        uint32_t portintr       : 1;
        uint32_t hcintr         : 1;
        uint32_t ptxfempty      : 1;
        uint32_t res27          : 1;
        uint32_t conidstschng   : 1;
        uint32_t disconnect     : 1;
        uint32_t sessreqintr    : 1;
        uint32_t wkupintr       : 1;
    } b;
} USB_STM32F407_GINTSTS;

typedef union _usb_stm32f407_drxsts
{
    uint32_t d32;
    struct
    {
        uint32_t epnum          : 4;
        uint32_t bcnt           : 11;
        uint32_t dpid           : 2;
        uint32_t pktsts         : 4;
        uint32_t fn             : 4;
        uint32_t res            : 7;
    } b;
} USB_STM32F407_DRXSTS;

typedef union _usb_stm32f407_grxsts
{
    uint32_t d32;
    struct
    {
        uint32_t chnum          : 4;
        uint32_t bcnt           : 11;
        uint32_t dpid           : 2;
        uint32_t pktsts         : 4;
        uint32_t res            : 11;
    } b;
} USB_STM32F407_GRXSTS;

typedef union _usb_stm32f407_fsiz
{
    uint32_t d32;
    struct
    {
        uint32_t startaddr      : 16;
        uint32_t depth          : 16;
    } b;
} USB_STM32F407_FSIZ;

typedef union _usb_stm32f407_hnptxsts
{
    uint32_t d32;
    struct
    {
        uint32_t nptxfspcavail  : 16;
        uint32_t nptxqspcavail  : 8;
        uint32_t nptxqtop_terminate     : 1;
        uint32_t nptxqtop_timer : 2;
        uint32_t nptxqtop       : 2;
        uint32_t chnum          : 2;
        uint32_t res            : 1;
    } b;
} USB_STM32F407_HNPTXSTS;

typedef union _usb_stm32f407_dtxfsts
{
    uint32_t d32;
    struct
    {
        uint32_t txfspcavail    : 16;
        uint32_t res            : 16;
    } b;
} USB_STM32F407_DTXFSTS;

typedef union _usb_stm32f407_gi2cctl
{
    uint32_t d32;
    struct
    {
        uint32_t rwdata         : 8;
        uint32_t regaddr        : 8;
        uint32_t addr           : 7;
        uint32_t i2cen          : 1;
        uint32_t ack            : 1;
        uint32_t i2csuspctl     : 1;
        uint32_t i2cdevaddr     : 2;
        uint32_t dat_se0        : 1;
        uint32_t res            : 1;
        uint32_t rw             : 1;
        uint32_t bsydne         : 1;
    } b;
} USB_STM32F407_GI2CCTL;

