n3rd-bugs/weird-rtos/port/target/stm32f407discovery/io/usb/usb_registers_stm32f407.h
typedef union _usb_stm32f407_gccfg
{
    uint32_t d32;
    struct
    {
        uint32_t res_in         : 16;
        uint32_t pwdn           : 1;
        uint32_t i2cifen        : 1;
        uint32_t vbussensingA   : 1;
        uint32_t vbussensingB   : 1;
        uint32_t sofouten       : 1;
        uint32_t disablevbussensing     : 1;
        uint32_t res_out        : 10;
    } b;
} USB_STM32F407_GCCFG;

typedef union _usb_stm32f407_dcfg
{
    uint32_t d32;
    struct
    {
        uint32_t devspd         : 2;
        uint32_t nzstsouthshk   : 1;
        uint32_t res3           : 1;
        uint32_t devaddr        : 7;
        uint32_t perfrint       : 2;
        uint32_t res13_17       : 5;
        uint32_t epmscnt        : 4;
        uint32_t pad            : 10;
    } b;
} USB_STM32F407_DCFG;

typedef union _usb_stm32f407_dctl
{
    uint32_t d32;
    struct
    {
        uint32_t rmtwkupsig     : 1;
        uint32_t sftdiscon      : 1;
        uint32_t gnpinnaksts    : 1;
        uint32_t goutnaksts     : 1;
        uint32_t tstctl         : 3;
        uint32_t sgnpinnak      : 1;
        uint32_t cgnpinnak      : 1;
        uint32_t sgoutnak       : 1;
        uint32_t cgoutnak       : 1;
        uint32_t res            : 21;
    } b;
} USB_STM32F407_DCTL;

typedef union _usb_stm32f407_dsts
{
    uint32_t d32;
    struct
    {
        uint32_t suspsts        : 1;
        uint32_t enumspd        : 2;
        uint32_t errticerr      : 1;
        uint32_t res4_7         : 4;
        uint32_t soffn          : 14;
        uint32_t res22_31       : 10;
    } b;
} USB_STM32F407_DSTS;

typedef union _usb_stm32f407_diepint
{
    uint32_t d32;
    struct
    {
        uint32_t xfercompl      : 1;
        uint32_t epdisabled     : 1;
        uint32_t ahberr         : 1;
        uint32_t timeout        : 1;
        uint32_t intktxfemp     : 1;
        uint32_t intknepmis     : 1;
        uint32_t inepnakeff     : 1;
        uint32_t emptyintr      : 1;
        uint32_t txfifoundrn    : 1;
        uint32_t res08_31       : 23;
    } b;
} USB_STM32F407_DIEPINT;

typedef union _usb_stm32f407_diepint USB_STM32F407_DIEPMSK;

typedef union _usb_stm32f407_doepint
{
    uint32_t d32;
    struct
    {
        uint32_t xfercompl      : 1;
        uint32_t epdisabled     : 1;
        uint32_t ahberr         : 1;
        uint32_t setup          : 1;
        uint32_t res04_31       : 28;
    } b;
} USB_STM32F407_DOEPINT;

typedef union _usb_stm32f407_doepint   USB_STM32F407_DOEPMSK;

typedef union _usb_stm32f407_daint
{
    uint32_t d32;
    struct
    {
        uint32_t in             : 16;
        uint32_t out            : 16;
    } ep;
} USB_STM32F407_DAINT;

typedef union _usb_stm32f407_dthrctl
{
    uint32_t d32;
    struct
    {
        uint32_t non_iso_thr_en : 1;
        uint32_t iso_thr_en     : 1;
        uint32_t tx_thr_len     : 9;
        uint32_t res11_15       : 5;
        uint32_t rx_thr_en      : 1;
        uint32_t rx_thr_len     : 9;
        uint32_t res26_31       : 6;
    } b;
} USB_STM32F407_DTHRCTL;

typedef union _usb_stm32f407_depctl
{
    uint32_t d32;
    struct
    {
        uint32_t mps            : 11;
        uint32_t res            : 4;
        uint32_t usbactep       : 1;
        uint32_t dpid           : 1;
        uint32_t naksts         : 1;
        uint32_t eptype         : 2;
        uint32_t snp            : 1;
        uint32_t stall          : 1;
        uint32_t txfnum         : 4;
        uint32_t cnak           : 1;
        uint32_t snak           : 1;
        uint32_t setd0pid       : 1;
        uint32_t setd1pid       : 1;
        uint32_t epdis          : 1;
        uint32_t epena          : 1;
    } b;
} USB_STM32F407_DEPCTL;

typedef union _usb_stm32f407_depxfrsiz
{
    uint32_t d32;
    struct
    {
        uint32_t xfersize       : 19;
        uint32_t pktcnt         : 10;
        uint32_t mc             : 2;
        uint32_t res            : 1;
    } b;
} USB_STM32F407_DEPXFRSIZ;

typedef union _usb_stm32f407_dep0rfrsiz
{
    uint32_t d32;
    struct
    {
        uint32_t xfersize       : 7;
        uint32_t res7_18        : 12;
        uint32_t pktcnt         : 2;
        uint32_t res20_28       : 9;
        uint32_t supcnt         : 2;
    } b;
} USB_STM32F407_DEP0XFRSIZ;

typedef union _usb_stm32f407_hcfg
{
    uint32_t d32;
    struct
    {
        uint32_t fslspclksel    : 2;
        uint32_t fslssupp       : 1;
        uint32_t pad            : 29;
    } b;
} USB_STM32F407_HCFG;

typedef union _usb_stm32f407_hfrminintrvl
{
    uint32_t d32;
    struct
    {
        uint32_t frint          : 16;
        uint32_t res            : 16;
    } b;
} USB_STM32F407_HFRMINTRVL;

typedef union _usb_stm32f407_hfnum
{
    uint32_t d32;
    struct
    {
        uint32_t frnum          : 16;
        uint32_t frrem          : 16;
    } b;
} USB_STM32F407_HFNUM;

typedef union _usb_stm32f407_hptxsts
{
    uint32_t d32;
    struct
    {
        uint32_t ptxfspcavail   : 16;
        uint32_t ptxqspcavail   : 8;
        uint32_t ptxqtop_terminate  : 1;
        uint32_t ptxqtop_timer  : 2;
        uint32_t ptxqtop        : 2;
        uint32_t chnum          : 2;
        uint32_t ptxqtop_odd    : 1;
    } b;
} USB_STM32F407_HPTXSTS;

typedef union _usb_stm32f407_hprt0
{
    uint32_t d32;
    struct
    {
        uint32_t prtconnsts     : 1;
        uint32_t prtconndet     : 1;
        uint32_t prtena         : 1;
        uint32_t prtenchng      : 1;
        uint32_t prtovrcurract  : 1;
        uint32_t prtovrcurrchng : 1;
        uint32_t prtres         : 1;
        uint32_t prtsusp        : 1;
        uint32_t prtrst         : 1;
        uint32_t res9           : 1;
        uint32_t prtlnsts       : 2;
        uint32_t prtpwr         : 1;
        uint32_t prttstctl      : 4;
        uint32_t prtspd         : 2;
        uint32_t res19_31       : 13;
    } b;
} USB_STM32F407_HPRT0;

typedef union _usb_stm32f407_haint
{
    uint32_t d32;
    struct
    {
        uint32_t chint          : 16;
        uint32_t res            : 16;
    } b;
} USB_STM32F407_HAINT;

