n3rd-bugs/weird-rtos/port/target/stm32f407discovery/io/usb/usb_registers_stm32f407.h
typedef union _usb_stm32f407_haintmsk
{
    uint32_t d32;
    struct
    {
        uint32_t chint          : 16;
        uint32_t res            : 16;
    } b;
} USB_STM32F407_HAINTMSK;

typedef union _usb_stm32f407_hcchar
{
    uint32_t d32;
    struct
    {
        uint32_t mps            : 11;
        uint32_t epnum          : 4;
        uint32_t epdir          : 1;
        uint32_t res            : 1;
        uint32_t lspddev        : 1;
        uint32_t eptype         : 2;
        uint32_t multicnt       : 2;
        uint32_t devaddr        : 7;
        uint32_t oddfrm         : 1;
        uint32_t chdis          : 1;
        uint32_t chen           : 1;
    } b;
} USB_STM32F407_HCCHAR;

typedef union _usb_stm32f407_hcsplt
{
    uint32_t d32;
    struct
    {
        uint32_t prtaddr        : 7;
        uint32_t hubaddr        : 7;
        uint32_t xactpos        : 2;
        uint32_t compsplt       : 1;
        uint32_t res            : 14;
        uint32_t spltena        : 1;
    } b;
} USB_STM32F407_HCSPLT;

typedef union _usb_stm32f407_hcint
{
    uint32_t d32;
    struct
    {
        uint32_t xfercompl      : 1;
        uint32_t chhltd         : 1;
        uint32_t ahberr         : 1;
        uint32_t stall          : 1;
        uint32_t nak            : 1;
        uint32_t ack            : 1;
        uint32_t nyet           : 1;
        uint32_t xacterr        : 1;
        uint32_t bblerr         : 1;
        uint32_t frmovrun       : 1;
        uint32_t datatglerr     : 1;
        uint32_t res            : 21;
    } b;
} USB_STM32F407_HCINT;

typedef union _usb_stm32f407_hctsiz
{
    uint32_t d32;
    struct
    {
        uint32_t xfersize       : 19;
        uint32_t pktcnt         : 10;
        uint32_t pid            : 2;
        uint32_t dopng          : 1;
    } b;
} USB_STM32F407_HCTSIZ;

typedef union _usb_stm32f407_hcgintmsk
{
    uint32_t d32;
    struct
    {
        uint32_t xfercompl      : 1;
        uint32_t chhltd         : 1;
        uint32_t ahberr         : 1;
        uint32_t stall          : 1;
        uint32_t nak            : 1;
        uint32_t ack            : 1;
        uint32_t nyet           : 1;
        uint32_t xacterr        : 1;
        uint32_t bblerr         : 1;
        uint32_t frmovrun       : 1;
        uint32_t datatglerr     : 1;
        uint32_t res            : 21;
    } b;
} USB_STM32F407_HCGINTMSK;

typedef union _usb_stm32f407_pcgcctl
{
    uint32_t d32;
    struct
    {
        uint32_t stoppclk       : 1;
        uint32_t gatehclk       : 1;
        uint32_t res            : 30;
    } b;
} USB_STM32F407_PCGCCTL;

#endif /* CONFIG_USB */
#endif /* _USB_REGISTERS_STM32F407_H_  */
